<?php

namespace Modules\HR\Enums;

enum TargetTypeEnum: string
{
    case DOCTOR_INCOME = 'doctor_income';     // تارجت مبني على استحقاق/دخل الطبيب المحقق
    case CLINIC_REVENUE = 'clinic_revenue';   // تارجت مبني على إجمالي إيرادات المبيعات المحققة للمركز


    /*CLINIC_REVENUE (إجمالي إيراد المركز من مبيعات الطبيب):

فكرته الإدارية: التارجت مقاس بما أدخله الطبيب لخزينة المركز (مثلاً: "إذا حققت مبيعات للمركز قيمتها 50,000 ج هذا الشهر، تنتقل للشريحة الأعلى 15%").
معياره: مجموع الفواتير التي تمت باسم الطبيب $clinicRevenueGenerated.
DOCTOR_INCOME (مستحقات ودخل الطبيب نفسه):

فكرته الإدارية: التارجت مقاس بإنتاجية الطبيب الشخصية (مثلاً: "إذا وصلت أرباحك وعمولاتك الشخصية وساعاتك إلى 8,000 ج، تأخذ ترقية للشريحة الأعلى وبونص").
معياره: مجموع (أجر الساعات + العمولات الأساسية) للطبيب.*/
}
